Қазақстанда заманауи білім беруді дамыту жүйесіне зор мән берілуде. Білім беру орындарының материалдық-техникалық
қоры күннен күнге нығайтылуда. Бүгінгі таңда ғылым мен техниканың даму деңгейі әрбір адамға сапалы және терең білім
алуға мүмкіндік береді. Біздің негізгі мақсатымыз – осы заманғы білім беру деңгейін жаңа технологияларды қолдана отырып,
әлемдік стандарттарға теңестіру. Жалпы білім берудегі маңыздылығы, теориялық анақтамаларымен қатар тәжірибелік
қолданыстарының да көлемімен ерекшеленетін – ол математика. Математика барлық маман иесінің логикалық ойлау қабілетін
жетілдіреді.