Коши есебі – дифференциалдық теңдеулер теориясының негізгі есептерінің бірі. Оны бірінші рет жүйелі
түрде француз ғалымы О.Коши (1789 – 1857) зерттеген. Коши есебі =fk(x), t=t0, xG0, k=0, ..., m–1,
(1) және N, m0
<m , m>0 бастапқы шартты қанағаттандыратын , (2) дифференциалдық теңдеуінің шешімін u (x, t), x=
    =(x1,
    ..., xn) арқылы өрнектейді: мұндағы G0 – x1, ..., xn айнымалы шамалар кеңістігінің t=t0
    гипержазықтық облысындағы бастапқы мәліметтерді тасымалдаушы, F және fk (мұндағы k=0, ..., m–1)
    өз
    аргументтерінің аналитикалық функциясы болғанда (1), (2) түріндегі Коши есебінің G0-тен тұратын
    t, x
    айнымалы шамалар кеңістігіндегі кейбір G облысында әрқашан да шешуі болады және ол біреу ғана
    болады.